import { PageWrapper } from "@/components/layout/page-wrapper";
import { Section } from "@/components/layout/section";
import { PrimaryButton, SecondaryButton, DangerButton } from "@/components/ui/button";
import { EmployeeCard } from "@/components/cards/employee-card";
export default function OrderPage() {
    return (
        <PageWrapper>
            <Section title="Замовлення №1">
                <div className="controls flex justify-between items-center w-full border-b-2 border-rich-black pb-8">
                    <SecondaryButton>Назад</SecondaryButton>
                    <div className="flex gap-4 ">
                        <PrimaryButton>Зв'язатися</PrimaryButton>
                        {/* <DangerButton>Report</DangerButton> */}
                        <SecondaryButton size="icon"><svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M12.1 18.55L12 18.65L11.89 18.55C7.14 14.24 4 11.39 4 8.5C4 6.5 5.5 5 7.5 5C9.04 5 10.54 6 11.07 7.36H12.93C13.46 6 14.96 5 16.5 5C18.5 5 20 6.5 20 8.5C20 11.39 16.86 14.24 12.1 18.55ZM16.5 3C14.76 3 13.09 3.81 12 5.08C10.91 3.81 9.24 3 7.5 3C4.42 3 2 5.41 2 8.5C2 12.27 5.4 15.36 10.55 20.03L12 21.35L13.45 20.03C18.6 15.36 22 12.27 22 8.5C22 5.41 19.58 3 16.5 3Z" fill="#0B0702" />
                        </svg>
                        </SecondaryButton>
                        <SecondaryButton size="icon"><svg width="6" height="24" viewBox="0 0 6 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M2.32145e-05 21.277V20.6204C0.0142862 20.5673 0.0380579 20.519 0.0475666 20.4659C0.256758 19.0851 1.38829 17.994 2.71473 17.9023C4.19808 17.796 5.45323 18.6554 5.8621 20.0555C5.9144 20.239 5.95243 20.4321 5.99998 20.6204V21.277C5.98571 21.3205 5.96194 21.3591 5.95719 21.4074C5.75275 22.6819 4.84943 23.6524 3.6133 23.9276C3.51821 23.9469 3.42312 23.9759 3.32804 24H2.68145C2.63866 23.9855 2.59587 23.9614 2.55308 23.9565C1.31695 23.7538 0.375616 22.8606 0.0903322 21.6198C0.0618061 21.4991 0.0285493 21.388 2.32145e-05 21.277ZM6 2.71815L5.99998 3.37481C5.98571 3.42792 5.96194 3.4762 5.95719 3.52931C5.74324 4.91978 4.60695 6.00608 3.26623 6.09299C1.78763 6.18955 0.53724 5.3205 0.133121 3.91555C0.0808232 3.73689 0.042789 3.55345 0 3.37479V2.71818C0.014263 2.67472 0.0380347 2.6361 0.0475434 2.59265C0.275752 1.33736 0.993656 0.516598 2.19175 0.125529C2.34864 0.0724204 2.51504 0.0434522 2.67669 0H3.32328C3.36607 0.0144841 3.40886 0.0386242 3.45165 0.0434522C4.69253 0.251057 5.62914 1.13941 5.9144 2.38021C5.94295 2.49609 5.97147 2.60713 6 2.71815ZM5.99998 11.6693V12.3259C5.98571 12.379 5.96194 12.4273 5.95243 12.4804C5.73849 13.8661 4.55941 14.9814 3.2282 15.0393C1.73058 15.1069 0.461171 14.1896 0.104595 12.7749C0.0665606 12.6253 0.0332804 12.4756 0 12.3259V11.6693C0.014263 11.6162 0.0380347 11.5679 0.0475434 11.5148C0.256734 10.1292 1.44056 9.01389 2.77178 8.95115C4.2694 8.87873 5.53881 9.80089 5.89538 11.2155C5.93342 11.37 5.96669 11.5197 5.99998 11.6693Z" fill="black" />
                        </svg>

                        </SecondaryButton>
                    </div>
                </div>
                <div className="flex flex-col gap-4 mt-4">
                    <h1>Підготовка до ЗНО з математики</h1>
                    <h2>400 грн/год</h2>
                    <h5>Математика  - Репетиторство</h5>
                    <p className="p2">28 січня 2025</p>
                    <span>
                        <h5>Ім’я замовника</h5>
                        <p>Потрібен репетитор для підготовки до ЗНО з математики. Основна увага – задачі з параметрами, логарифми та геометрія. Заняття двічі на тиждень по 1,5 години.</p>
                    </span>
                    <h5>1 червня 2025</h5>
                </div>
                {/* <div>
                    <h2>Виконує</h2>
                    <EmployeeCard
                        name="Смирнова Марія"
                        rating='4.9/5'
                        avatarId={1}
                        education="Магістр з інформатики, сертифікат з академічного письма"
                        worksSince="На сайті з 14.01"
                        description="Я професійно допомагаю студентам на всіх етапах написання дипломних робіт: від вибору теми та планування до написання та оформлення роботи відповідно до вимог ВНЗ."
                    />
                </div> */}
            </Section>
        </PageWrapper>
    )
}